# Minahil Chaudhary
## Week 15 11/29/22
### Python - Pandas DataFrame - Mapping, Applying and Grouping

In [1]:
import numpy as np

In [4]:
import pandas as pd
from pandas import Series, DataFrame

In [5]:
#mapping
df = DataFrame({'city': ['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'],
               'altitude': [10355,9800, 9062, 8966]})

In [6]:
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [7]:
st_map={'Alma': 'Colorado', 'Brian Head':'Utah', 'Fox Park': 'Wyoming', 'Lake Mary': 'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [9]:
df['state'] = df['city'].map(st_map)

In [10]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [11]:
#apply
def meter(x):
    return x / 3.2808

In [12]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 2850 else x )

In [13]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [14]:
df.fillna(0,inplace=True)

In [15]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [20]:
df = DataFrame(np.random.randn(4,3),
              columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT  1.746173 -0.347008 -0.319121
OH -0.421946  2.074811  1.520255
TX  1.021731 -0.446738  1.014315
OR  0.005158 -0.034709 -1.402837

In [21]:
def dif(x):
    return x.max() - x.min()

In [22]:
dif

In [23]:
df.apply(dif)

b    2.168119
d    2.521549
e    2.923092
dtype: float64

In [24]:
df.apply(dif, axis=1)

UT    2.093181
OH    2.496758
TX    1.468469
OR    1.407995
dtype: float64

In [26]:
df.apply(lambda x: x.max() - x.min())

b    2.168119
d    2.521549
e    2.923092
dtype: float64

In [27]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

UT    2.093181
OH    2.496758
TX    1.468469
OR    1.407995
dtype: float64

In [28]:
df.apply(pd.value_counts)

             b    d    e
-1.402837  NaN  NaN  1.0
-0.446738  NaN  1.0  NaN
-0.421946  1.0  NaN  NaN
-0.347008  NaN  1.0  NaN
-0.319121  NaN  NaN  1.0
-0.034709  NaN  1.0  NaN
 0.005158  1.0  NaN  NaN
 1.014315  NaN  NaN  1.0
 1.021731  1.0  NaN  NaN
 1.520255  NaN  NaN  1.0
 1.746173  1.0  NaN  NaN
 2.074811  NaN  1.0  NaN

In [29]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.402837  0.0  0.0  1.0
-0.446738  0.0  1.0  0.0
-0.421946  1.0  0.0  0.0
-0.347008  0.0  1.0  0.0
-0.319121  0.0  0.0  1.0
-0.034709  0.0  1.0  0.0
 0.005158  1.0  0.0  0.0
 1.014315  0.0  0.0  1.0
 1.021731  1.0  0.0  0.0
 1.520255  0.0  0.0  1.0
 1.746173  1.0  0.0  0.0
 2.074811  0.0  1.0  0.0

In [30]:
df.apply(pd.value_counts).fillna(0).astype('int')

           b  d  e
-1.402837  0  0  1
-0.446738  0  1  0
-0.421946  1  0  0
-0.347008  0  1  0
-0.319121  0  0  1
-0.034709  0  1  0
 0.005158  1  0  0
 1.014315  0  0  1
 1.021731  1  0  0
 1.520255  0  0  1
 1.746173  1  0  0
 2.074811  0  1  0

In [32]:
#groupby
df = DataFrame({'k1' : ['a', 'a', 'b', 'b', 'c'],
               'k2' : ['one', 'two', 'one', 'two', 'one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.874503 -1.706483
1  a  two -0.727169 -0.917720
2  b  one  0.523750 -1.188450
3  b  two  0.202314  0.985960
4  c  one  2.469933  0.307748

In [33]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [34]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a   0.147334 -2.624203
b   0.726064 -0.202490
c   2.469933  0.307748

In [35]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.073667 -1.312101
b   0.363032 -0.101245
c   2.469933  0.307748

In [36]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.874503 -1.706483
1  a  two -0.727169 -0.917720
2  b  one  0.523750 -1.188450
3  b  two  0.202314  0.985960
4  c  one  2.469933  0.307748

In [37]:
df.groupby('k2').count()

     k1  dataset1  dataset2
k2
one   3         3         3
two   2         2         2

In [38]:
df.groupby('k2').sum()

     dataset1  dataset2
k2
one  3.868186 -2.587185
two -0.524856  0.068240

In [39]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one  1.289395 -0.862395
two -0.262428  0.034120

In [41]:
df.groupby(['k1', 'k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [44]:
df.groupby(['k1', 'k2']).sum()

        dataset1  dataset2
k1 k2
a  one  0.874503 -1.706483
   two -0.727169 -0.917720
b  one  0.523750 -1.188450
   two  0.202314  0.985960
c  one  2.469933  0.307748

In [45]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.874503 -1.706483
1  a  two -0.727169 -0.917720
2  b  one  0.523750 -1.188450
3  b  two  0.202314  0.985960
4  c  one  2.469933  0.307748

In [46]:
df['dataset1'].groupby(df['k1']).sum()

k1
a    0.147334
b    0.726064
c    2.469933
Name: dataset1, dtype: float64

In [47]:
group = df.groupby(['k1', 'k2'])['dataset2']

In [48]:
group

In [55]:
group.count()

k1  k2
a   one    1
    two    1
b   one    1
    two    1
c   one    1
Name: dataset2, dtype: int64

In [56]:
group.mean()

k1  k2
a   one   -1.706483
    two   -0.917720
b   one   -1.188450
    two    0.985960
c   one    0.307748
Name: dataset2, dtype: float64

In [57]:
group.sum()

k1  k2
a   one   -1.706483
    two   -0.917720
b   one   -1.188450
    two    0.985960
c   one    0.307748
Name: dataset2, dtype: float64